let a = Math.floor(Math.random() * 100);
console.log("Исходное решение Tern1:");
console.log(
    (a > 10 ? a : a * 2) > 5 ? (2 * a) + 1 : (a < 3 ? 1 : 2 * (a - 2)) > 4 ? 5 : (a % 2 == 0 ? 6 : 7)
);

// условие с условным (тернарным) оператором перевести в if...else И switch()
// результат выводить в консоль, с пощью console.log()




// // решение влоб
// if ((a > 10 ? a : a * 2) > 5) {
//     console.log((2 * a) + 1);
// } else {
//     if ((a < 3 ? 1 : 2 * (a - 2)) > 4) {
//         console.log(5);
//     } else {
//         if (a % 2 == 0) {
//             console.log(6);
//         } else {
//             console.log(7);
//         }
//     }
// }

// выполним преобразования для упрощения

// (a > 10 ? a : a * 2) > 5
// (a > 10 && a > 5) эквивалентно (a > 10)
// (a < 10 && a * 2 > 5) эквивалентно (a < 10 && a * 2 > 5)
// значит ((a > 10 ? a : a * 2) > 5) эквивалентно (a * 2 > 5)
// получим:
// (a * 2 > 5) ? (2 * a) + 1 : (a < 3 ? 1 : 2 * (a - 2)) > 4 ? 5 : (a % 2 == 0 ? 6 : 7)

// ((a < 3 ? 1 : 2 * (a - 2)) > 4)
// (a < 3 && 1 > 4) эквивалентно (false)
// (2 * (a - 2) > 4) эквивалентно (a > 4)
// значит ((a < 3 ? 1 : 2 * (a - 2)) > 4) эквивалентно (a > 4)
// получим:
// (a * 2 > 5) ? (2 * a) + 1 : (a > 4) ? 5 : (a % 2 == 0 ? 6 : 7)

// вывод "5" никогда не достигнем, так как:
// из условия (a * 2 > 5)=>false никогда не попадем в (a > 4)=>true
// поэтому получим:
// (a * 2 > 5) ? (2 * a) + 1 : (a % 2 == 0 ? 6 : 7)


console.log("Мое решение Tern1 с if...else:");

if (a * 2 > 5) {
    console.log((2 * a) + 1);
} else if (a % 2 == 0) {
    console.log(6);
} else {
    console.log(7);
}


console.log("Мое решение Tern1 с switch():");

switch (true) {
    case a * 2 > 5:
        console.log((2 * a) + 1);
        break;
    case a % 2 == 0:
        console.log(6);
        break;
    case !(a % 2 == 0):
        console.log(7);
        break;
}
